/* 
 * WRANING: These codes below is far away from bugs with the god and his animal protecting
 *                  _oo0oo_                   ┏┓　　　┏┓
 *                 o8888888o                ┏┛┻━━━┛┻┓
 *                 88" . "88                ┃　　　　　　　┃ 　
 *                 (| -_- |)                ┃　　　━　　　┃
 *                 0\  =  /0                ┃　┳┛　┗┳　┃
 *               ___/`---'\___              ┃　　　　　　　┃
 *             .' \\|     |# '.             ┃　　　┻　　　┃
 *            / \\|||  :  |||# \            ┃　　　　　　　┃
 *           / _||||| -:- |||||- \          ┗━┓　　　┏━┛
 *          |   | \\\  -  #/ |   |          　　┃　　　┃神兽保佑
 *          | \_|  ''\---/''  |_/ |         　　┃　　　┃永无BUG
 *          \  .-\__  '-'  ___/-. /         　　┃　　　┗━━━┓
 *        ___'. .'  /--.--\  `. .'___       　　┃　　　　　　　┣┓
 *     ."" '<  `.___\_<|>_/___.' >' "".     　　┃　　　　　　　┏┛
 *    | | :  `- \`.;`\ _ /`;.`/ - ` : | |   　　┗┓┓┏━┳┓┏┛
 *    \  \ `_.   \_ __\ /__ _/   .-` /  /   　　　┃┫┫　┃┫┫
 *=====`-.____`.___ \_____/___.-`___.-'=====　　　┗┻┛　┗┻┛ 
 *                  `=---='　　　
 *          佛祖保佑       永无BUG
 */
// =============================================================================== 
// Author              :    Frankie.W
// Create Time         :    2017/7/13 15:27:51
// Update Time         :    2017/7/13 15:27:51
// Class Version       :    v1.0.0.0
// Class Description   :    
// ===============================================================================
using SQLite;
// ===============================================================================
namespace FKLog
{
    /// <summary>
    /// 数据库中Task所对应日志时间的信息结构
    /// Comment: 通过该表查找到指定TaskID所在的日志文件，
    ///          然后再读取日志文件获取指定TaskID的日志记录
    /// </summary>
    public struct FKSQLiteLogTimeNode
    {
        // 数据库中ID
        [AutoIncrement, PrimaryKey]
        public int Id { get; set; }

        // 任务ID
        public int TaskId { get; set; }
        // 任务日志记录时间
        public string LogTime { get; set; }
    }
}
